tiborsimon/embedded-tdd-headers/pic/8bit/pic12f629_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F629_H_
#define _PIC12F629_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define RP0                           11
#define RP                            12
#define RP1                           13
#define IRP                           14
#define FSR                           15
#define GPIO                          16
#define GPIO0                         17
#define GP0                           18
#define GPIO1                         19
#define GP1                           20
#define GPIO2                         21
#define GP2                           22
#define GPIO3                         23
#define GP3                           24
#define GPIO4                         25
#define GP4                           26
#define GPIO5                         27
#define GP5                           28
#define PCLATH                        29
#define INTCON                        30
#define GPIF                          31
#define INTF                          32
#define TMR0IF                        33
#define T0IF                          34
#define GPIE                          35
#define INTE                          36
#define T0IE                          37
#define TMR0IE                        38
#define PEIE                          39
#define GIE                           40
#define PIR1                          41
#define T1IF                          42
#define TMR1IF                        43
#define CMIF                          44
#define ADIF                          45
#define EEIF                          46
#define TMR1L                         47
#define TMR1H                         48
#define T1CON                         49
#define TMR1ON                        50
#define TMR1CS                        51
#define nT1SYNC                       52
#define T1OSCEN                       53
#define T1CKPS0                       54
#define T1CKPS                        55
#define T1CKPS1                       56
#define TMR1GE                        57
#define CMCON                         58
#define CM                            59
#define CM0                           60
#define CM1                           61
#define CM2                           62
#define CIS                           63
#define CINV                          64
#define COUT                          65
#define OPTION_REG                    66
#define PS                            67
#define PS0                           68
#define PS1                           69
#define PS2                           70
#define PSA                           71
#define T0SE                          72
#define T0CS                          73
#define INTEDG                        74
#define nGPPU                         75
#define TRISIO                        76
#define TRISIO0                       77
#define TRISIO1                       78
#define TRISIO2                       79
#define TRISIO3                       80
#define TRISIO4                       81
#define TRISIO5                       82
#define PIE1                          83
#define T1IE                          84
#define TMR1IE                        85
#define CMIE                          86
#define ADIE                          87
#define EEIE                          88
#define PCON                          89
#define nBOR                          90
#define nBOD                          91
#define nPOR                          92
#define OSCCAL                        93
#define CAL0                          94
#define CAL                           95
#define CAL1                          96
#define CAL2                          97
#define CAL3                          98
#define CAL4                          99
#define CAL5                          100
#define WPU                           101
#define WPU0                          102
#define WPU1                          103
#define WPU2                          104
#define WPU4                          105
#define WPU5                          106
#define IOC                           107
#define IOC0                          108
#define IOCB0                         109
#define IOC1                          110
#define IOCB1                         111
#define IOC2                          112
#define IOCB2                         113
#define IOCB3                         114
#define IOC3                          115
#define IOCB4                         116
#define IOC4                          117
#define IOC5                          118
#define IOCB5                         119
#define VRCON                         120
#define VR0                           121
#define VR                            122
#define VR1                           123
#define VR2                           124
#define VR3                           125
#define VRR                           126
#define VREN                          127
#define EEDATA                        128
#define EEADR                         129
#define EECON1                        130
#define RD                            131
#define WR                            132
#define WREN                          133
#define WRERR                         134
#define EECON2                        135

#endif // _PIC12F629_H_
